docs/ejercicios_arquitectura.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head><meta http-equiv="Content-Type" content="text/html;charset=utf-8"><meta name="viewport" content="width=device-width, initial-scale=1"><title>Ejercicios arquitectura de videojuegos</title><meta name="author" content="Carlos León"><meta name="generator" content="Org Mode"></head><body> <div id="content" class="content"> <h1 class="title">Ejercicios arquitectura de videojuegos</h1> <div id="outline-container-ejercicio-1" class="outline-2"> <h2 id="ejercicio-1"><span class="section-number-2">1.</span> Ejercicio 1</h2> <div class="outline-text-2" id="text-ejercicio-1"> <p> Basándote en el código de ejemplo de componentes, añade un tipo de mensaje llamado <code>Sleep</code>, que haga que la entidad que lo reciba no haga nada durante su ciclo, pasen los ciclos que pasen, hasta que reciba un mensaje <code>WakeUp</code> (también tienes que implementar este mensaje). </p> </div> </div> <div id="outline-container-ejercicio-2" class="outline-2"> <h2 id="ejercicio-2"><span class="section-number-2">2.</span> Ejercicio 2</h2> <div class="outline-text-2" id="text-ejercicio-2"> <p> Basándote en el código de ejemplo de componentes, crea un tipo de componente que, en cada ciclo, aumente la vida de una entidad. Llámalo <code>Healer</code>. Ten en cuenta que en el diseño original del código de ejemplo de componentes, las entidades no tienen vida. Tendrás que crear, para implementar este componente, otro componente que usen las entidades que tienen vida. </p> <p> Piensa en cómo deben comunicarse estas entidades. La idea del ejercicio es que el diseño siga siendo orientado a componentes y que sea lo más puro posible. </p> </div> </div> <div id="outline-container-ejercicio-3" class="outline-2"> <h2 id="ejercicio-3"><span class="section-number-2">3.</span> Ejercicio 3</h2> <div class="outline-text-2" id="text-ejercicio-3"> <p> Modifica el código original para que la función <code>tick</code> de <code>Game</code> no se envíe el mensaje <code>Presence</code>, sino que cada entidad lance el mensaje según lo considere oportuno. </p> <p> (PISTA: las entidades "dormidas" no tienen que anunciar su presencia, pero esto no debería modificar mucho el código del <a href="#ejercicio-1">ejercicio 1</a>). </p> </div> </div> <div id="outline-container-ejercicio-4" class="outline-2"> <h2 id="ejercicio-4"><span class="section-number-2">4.</span> Ejercicio 4</h2> <div class="outline-text-2" id="text-ejercicio-4"> <ol class="org-ol"> <li>Haz un componente para entidades que se muevan. No te preocupes por la implementación, con que la entidad imprima "me estoy moviendo" en cada ciclo, junto a su nombre, es suficiente.</li> <li>Haz un componente para entidades que tengan volumen físico (entidades con las que se pueda colisionar). No te preocupes por la implementación, con que la entidad imprima "tengo volumen" en cada ciclo, junto a su nombre, es suficiente.</li> <li>Crea una entidad que se mueva, pero no tenga volumen físico. Añádela al juego.</li> <li>Crea una entidad que tenga volumen físico, pero que no se mueva. Añádela al juego.</li> <li>Crea una entidad que tenga volumen físico y que se mueva. Añádela al juego.</li> </ol> <p> Ahora, teniendo en cuenta que <i>tienes que usar herencia</i>, añade en alguna parte de tu código un comentario con una jerarquía de clases que te permita implementar los puntos 3, 4 y 5. <b>No tienes que implementarla, sólo pensar en ella y añadir un bloque de comentario en el archivo con lo que se te ocurra</b>. Sé original y piensa en las alternativas. </p> </div> </div> </div> <div id="postamble" class="status"> <p class="author">Author: Carlos León</p> <p class="date">Created: 2025-01-16 jue 10:16</p> <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p> </div> </body></html>